<?php
	//前加加 （++$a）  先运算后赋值   和  后加加  先赋值 后运算 
	//$a++  ++$a
	$a = 100;
	$b = 100;
//	201 	100|101       101|101
	$c =     $a++ 		+ ++$b;

	echo $a;// 101
	echo $b;// 101
	echo $c;// 201 


	echo '<hr/>';

	$a = 100;
	$b = 100;
//	201	  101|101	 100|101
	$c =  ++$a    +  $b++;
//	100	  201|202	  101|102
	$d =  $c++ 	  -  $a++;

	echo $a;//102       
	echo $b;//101     
	echo $c;//202     
	echo $d;//100  
	echo '<hr/>';

//减减   自减一
//前减减(--$a)  先运算后赋值    后减减($a--) 先赋值后运算
// --$a  $a--

$a=10;
$n=$a--;
echo $a;//9
echo $n;//10
echo '<hr/>';

$a = 10;
$b = 10;
$c = $a--;
$d = --$b;
echo $a;//9
echo $b;//9
echo $c;//10
echo $d;//9

echo '<hr/>';

$a = 100;
$b = 100;
//200	 100|101 + 100|99 
$c = 		$a++ +   $b--;
//101	 201|201 - 100|100 
$d =     ++$c -    --$a;

echo $a;//100    
echo $b;//99     
echo $c;//201    
echo $d;//101	 

echo '<hr/>';

$a = 100;
$b = 100;
$c = $a++ - $b--;
$d = --$a + ++$c;
$e = $d-- +--$b;
$f = $a++ + $b-- - --$c + ++$e;

echo $a;
echo $b;
echo $c;
echo $d;
echo $e;
echo $f;


